# Length Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Curve..::..Length Property
Curve Class See Also
---
The exact length of the curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Length { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Length As Double
	Get
```

Visual C++
---
```text
public:
property double Length {
	double get ();
}
```

# Remarks
Computes the length of the curve using analytical or numeric integration. There is no performance hit for lines and arcs.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the curve is unbound and not periodic. |

# See Also
Curve Class
Autodesk.Revit.DB Namespace